[
  {
    "id": 1,
    "title": "Dua when waking up in the morning",
    "content": "الحَمْدُ لِلهِ الَّذِي أَحْيَانَا بَعْدَ مَا أَمَاتَنَا وَإِلَيْهِ النُّشُورُ",
    "tags": ["Sunnah", "Dailylife", "Sleep", "Wakeup"],
    "referenceLink": "https://sunnah.com/bukhari:6312",
    "translation": "ہم سے قبیصہ بن عقبہ نے بیان کیا ، کہا ہم سے سفیان ثوری نے بیان کیا ، ان سے عبدالملک بن عمیر نے ، ان سے ربعی بن حراش نے اور ان سے حضرت حذیفہ بن یمان رضی اللہ عنہ نے بیان کیاکہ نبی کریم صلی اللہ علیہ وسلم جب اپنے بستر پر لیٹتے تو یہ کہتے ” تیرے ہی نام کے ساتھ میں مردہ اور زندہ رہتا ہوں اور جب بیدار ہوتے تو کہتے اسی اللہ کے لئے تمام تعریفیں ہیں جس نے ہمیں زندہ کیا ۔ اس کے بعد کہ اس نے موت طاری کر دی تھی اور اسی کی طرف لوٹنا ہے ۔ قرآن شریف میں جو لفظ ننشزھا ہے اس کا بھی یہی معنی ہے کہ ہم اس کو نکال کر اٹھاتے ہیں ۔"
  },
  {
    "id": 2,
    "title": "Dua if someone wakes up at night",
    "content": "لَا إِلَهَ إِلَّا اللهُ وَحْدَهُ لَا شَرِيكَ لَهُ ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ ، وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ ، سُبْحَانَ اللهِ وَالْحَمْدُ لِلهِ ، وَلَا إِلَهَ إِلَّا اللهُ وَاللهُ أَكْـبَرُ ، وَلَا حَوْلَ وَلَا قُوَّةَ إِلَّا بِاللهِ الْعَلِيِّ الْعَظِيمِ رَبِّ اغْفِرْ لِي",
    "tags": ["Sunnah", "Dailylife", "Sleep"],
    "referenceLink": "https://sunnah.com/abudawud:5060",
    "translation": "Ubadah b. al-Samit reported the Messenger of Allah (May peace be upon him) as saying; If anyone is alarmed while asleep and he says when awakes: \nThere is no god but Allah alone Who has no partner, to whom dominion belongs, to whom praise is due, and who has power over everything (omnipotent). Glory be to Allah, and praise be to Allah, and there is no god but Allah, and then he prays: O my Lord, forgive me. Abu Dawud said : Al-Walid’s version has; and he prays, his prayer will be answered. If he gets up, performs ablution, and prays, his prayer will be accepted."
  },
  {
    "id": 3,
    "title": "Dua when waking up in the morning",
    "content": "الْحَمْدُ لِلَّهِ الَّذِي عَافَانِي فِي جَسَدِي وَرَدَّ عَلَىَّ رُوحِي وَأَذِنَ لِي بِذِكْرِهِ",
    "tags": ["Sunnah", "Dailylife", "Sleep", "Wakeup"],
    "referenceLink": "https://sunnah.com/tirmidhi:3401",
    "translation": "All praise is for Allah who restored to me my health and returned my soul and has allowed me to remember Him."
  },
  {
    "id": 4,
    "title": "Dua when seeing a bad dream",
    "content": "أَعُوذُ بِاللهِ مِنَ الشَّيْطَانِ الرَّجِيمِ",
    "tags": ["Sunnah", "Dailylife", "Sleep", "Dream"],
    "referenceLink": "https://sunnah.com/bukhari:3292",
    "translation": "The Prophet (ﷺ) said, A good dream is from Allah, and a bad or evil dream is from Satan; so if anyone of you has a bad dream of which he gets afraid, he should spit on his left side and should seek Refuge with Allah from its evil, for then it will not harm him."
  },
  {
    "id": 5,
    "title": "Dua when putting a garment",
    "content": "الحَمْدُ لِلهِ الَّذِي كَسَانِي هَذَا الثَّوْبَ وَرَزَقَنِيهِ مِنْ غَيْرِ حَوْلٍ مِنِّي وَلَا قُوَّةٍ",
    "tags": ["Sunnah", "Dailylife", "Dress"],
    "referenceLink": "https://sunnah.com/abudawud:4023",
    "translation": "The Prophet (ﷺ) said: If anyone puts on a garment and says: \"Praise be to Allah Who has clothed me with this and provided me with it through no might and power on my part,\" he will be forgiven his former and later sins."
  },
  {
    "id": 6,
    "title": "Dua when eating the food",
    "content": "الْحَمْدُ لِلَّهِ الَّذِي أَطْعَمَنِي هَذَا الطَّعَامَ وَرَزَقَنِيهِ مِنْ غَيْرِ حَوْلٍ مِنِّي وَلاَ قُوَّةٍ",
    "tags": ["Sunnah", "Dailylife", "Food", "Eating"],
    "referenceLink": "https://sunnah.com/abudawud:4023",
    "translation": "The Prophet (ﷺ) said: If anyone eats food and then says: \"Praise be to Allah Who has fed me with this food and provided me with it through no might and power on my part,\" he will be forgiven his former and later sins."
  },
  {
    "id": 7,
    "title": "Dua before undressing",
    "content": "بِسمِ الله",
    "tags": ["Sunnah", "Dailylife", "Dress"],
    "referenceLink": "https://sunnah.com/tirmidhi:606",
    "translation": "Ali bin Abi Talid (may Allah be pleased with him) narrated that: \nThe Messenger of Allah said: \"The screen between the eyes of the jinns and nakedness of the children of Adam when one of you enters the area of relieving oneself is saying: 'Bismillah.'\""
  },
  {
    "id": 8,
    "title": "Dua before entering the toilet",
    "content": "اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الْخُبُثِ وَالْخَبَائِثِ",
    "tags": ["Sunnah", "Dailylife", "Toilet"],
    "referenceLink": "https://sunnah.com/muslim:375a",
    "translation": "When the Messenger of Allah (ﷺ) entered the privy, and in the hadith transmitted by Hushaim (the words are): When the Messenger of Allah (ﷺ) entered the lavatory, be used to say: O Allah, I seek refuge in Thee from wicked and noxious things."
  },
  {
    "id": 9,
    "title": "Dua after leaving the toilet",
    "content": "غُفْرَانَكَ",
    "tags": ["Sunnah", "Dailylife", "Toilet"],
    "referenceLink": "https://sunnah.com/abudawud:30",
    "translation": "When the Prophet (ﷺ) came out of the privy, he used to say: \"Grant me Thy forgiveness.\""
  },
  {
    "id": 10,
    "title": "Dua before starting Wudu",
    "content": "بِسْمِ اللهِ",
    "tags": ["Sunnah", "Dailylife", "Wudu"],
    "referenceLink": "https://sunnah.com/ibnmajah:398",
    "translation": "It was narrated that Abu Sa'eed bin Zaid said:\"The Messenger of Allah said: 'There is no prayer for one who does not have ablution, and there is no ablution for one who does not mention the Name of Allah (before it).\""
  },
  {
    "id": 10,
    "title": "Dua afer performing Wudu",
    "content": "أَشْهَدُ أَنْ لَا إِلَهَ إِلَّا اللَّهُ وَحْدَهُ لَا شَرِيكَ لَهُ، وَأَشْهَدُ أَنَّ مُحَمَّدًا عَبْدُهُ وَرَسُولُهُ, ،اللَّهُمَّ اجْعَلْنِي مِنَ التَّوَّابِينَ، وَاجْعَلْنِي مِنَ المُتَطَهِّرِينَ",
    "tags": ["Sunnah", "Dailylife", "Wudu"],
    "referenceLink": "https://sunnah.com/tirmidhi:55",
    "translation": "Allah's Messenger said: Whoever performs Wudu, making Wudu well, then says: (\"Ashhadu an la ilaha illallah, wahdahu la sharika lahu, wa ashhadu anna Muhammadan-abduhu wa rasuluhu, Allahummajalni minat tawwabin, waj'alni minal mutatahhirin\") 'I testify that none has the right to be worshipped but Allah Alone, there are no partners for Him. And I testify that Muhammad is His servant and Messenger. O Allah! Make me among the repentant, and make me among those who purify themselves.' Then eight gates of Paradise are opened for him, that may enter by whichever of them wishes."
  },
  {
    "id": 11,
    "title": "Dua before leaving the house",
    "content": "بِسْمِ اللهِ ، تَوَكَّلْتُ عَلَى اللهِ وَلَا حَوْلَ وَلَا قُوَّةَ إِلَّا بِاللهِ",
    "tags": ["Sunnah", "Dailylife", "House"],
    "referenceLink": "https://sunnah.com/abudawud:5095",
    "translation": "The Prophet (ﷺ) said: When a man goes out of his house and says: \"In the name of Allah, I trust in Allah; there is no might and no power but in Allah,\" the following will be said to him at that time: \"You are guided, defended and protected.\" The devils will go far from him and another devil will say: How can you deal with a man who has been guided, defended and protected?"
  }
]
