[
  {
    "id": "q1",
    "title": "Dua seeking guidance to straight path",
    "content": "ٱلْحَمْدُ لِلهِ رَبِّ الْعَـٰلَمِينَ (٢) ٱلرَّحْمَـٰنِ ٱلرَّحِيمِ (٣) مَـٰلِكِ يَوْمِ ٱلدِّينِ (٤) إِيَّاكَ نَعْبُدُ وَإِيَّاكَ نَسْتَعِينُ (٥) ٱهْدِنَا ٱلصِّرَٰطَ ٱلْمُسْتَقِيمَ (٦) صِرَٰطَ ٱلَّذِينَ أَنْعَمْتَ عَلَيْهِمْ غَيْرِ ٱلْمَغْضُوبِ عَلَيْهِمْ وَلَا ٱلضَّآلِّينَ (٧)",
    "translation": "",
    "tags": ["Quran", "Sunnah"],
    "referenceLink": "https://quran.com/1"
  },
  {
    "id": "q2",
    "title": "Durood-o-Salam on Prophets and Hamad of Allah in one Dua",
    "content": "سُبْحَـٰنَ رَبِّكَ رَبِّ ٱلْعِزَّةِ عَمَّا يَصِفُونَ (۱۸۰) وَسَلَـٰمٌ عَلَى ٱلْمُرْسَلِينَ (١٨١) وَٱلْحَمْدُ لِلَّهِ رَبِّ ٱلْعَـٰلَمِينَ (١٨٢) ",
    "translation": "(When you send Salam on me, send Salam on all the Messengers, for I am one of the Messengers.)\" This was recorded by Ibn Jarir and Ibn Abi Hatim. Abu Muhammad Al-Baghawi recorded in his Tafsir that Ali, may Allah be pleased with him, said: \"Whoever wants a greater measure of reward on the Day of Resurrection, let him say at the end of any gathering.",
    "tags": ["Quran", "Sunnah"],
    "referenceLink": "https://quran.com/37/180"
  },
  {
    "id": "q3",
    "title": "Dua of Ibrahim A.S when building the Kaabah",
    "content": " وَإِذْ يَرْفَعُ إِبْرَٰهِـۧمُ ٱلْقَوَاعِدَ مِنَ ٱلْبَيْتِ وَإِسْمَـٰعِيلُ رَبَّنَا تَقَبَّلْ مِنَّآ ۖ إِنَّكَ أَنتَ ٱلسَّمِيعُ ٱلْعَلِيمُ ١٢٧ رَبَّنَا وَٱجْعَلْنَا مُسْلِمَيْنِ لَكَ وَمِن ذُرِّيَّتِنَآ أُمَّةًۭ مُّسْلِمَةًۭ لَّكَ وَأَرِنَا مَنَاسِكَنَا وَتُبْ عَلَيْنَآ ۖ إِنَّكَ أَنتَ ٱلتَّوَّابُ ٱلرَّحِيمُ ١٢٨",
    "translation": "When Ibrāhīm was raising up the foundations of the House, along with Ismā‘īl (Ishmael) (supplicating): “Our Lord accept (this service) from us! Indeed, You - and You alone - are the All-Hearing, the All-Knowing!(127) Our Lord, make us both submissive to You, and (make) of our progeny as well, a people submissive to You and show us our ways of Pilgrimage and accept our repentance. Indeed, You - and You alone - are the Most-Relenting, the Very-Merciful.(128) [T. Usmani]",
    "tags": ["Quran", "Prophetic-Duas"],
    "referenceLink": "https://quran.com/2/127"
  },
  {
    "id": "q4",
    "title": "Dua for seeking goodness in this world and hereafter (Recommended by Allah SW)",
    "content": "وَمِنْهُم مَّن يَقُولُ رَبَّنَآ ءَاتِنَا فِى ٱلدُّنْيَا حَسَنَةًۭ وَفِى ٱلْـَٔاخِرَةِ حَسَنَةًۭ وَقِنَا عَذَابَ ٱلنَّارِ ٢٠١",
    "translation": "Yet there is another among them who says: “Our Lord, give us good in this world and good in the Hereafter, and save us from the punishment of Fire.(201)” [T. Usmani]",
    "tags": ["Quran", "General"],
    "referenceLink": "https://quran.com/2/201"
  },
  {
    "id": "q5",
    "title": "Dua given to Prophet (PBUH) on Mairaj",
    "content": "ءَامَنَ ٱلرَّسُولُ بِمَآ أُنزِلَ إِلَيْهِ مِن رَّبِّهِۦ وَٱلْمُؤْمِنُونَ ۚ كُلٌّ ءَامَنَ بِٱللَّهِ وَمَلَـٰٓئِكَتِهِۦ وَكُتُبِهِۦ وَرُسُلِهِۦ لَا نُفَرِّقُ بَيْنَ أَحَدٍۢ مِّن رُّسُلِهِۦ ۚ وَقَالُوا۟ سَمِعْنَا وَأَطَعْنَا ۖ غُفْرَانَكَ رَبَّنَا وَإِلَيْكَ ٱلْمَصِيرُ ٢٨٥لَا يُكَلِّفُ ٱللَّهُ نَفْسًا إِلَّا وُسْعَهَا ۚ لَهَا مَا كَسَبَتْ وَعَلَيْهَا مَا ٱكْتَسَبَتْ ۗ رَبَّنَا لَا تُؤَاخِذْنَآ إِن نَّسِينَآ أَوْ أَخْطَأْنَا ۚ رَبَّنَا وَلَا تَحْمِلْ عَلَيْنَآ إِصْرًۭا كَمَا حَمَلْتَهُۥ عَلَى ٱلَّذِينَ مِن قَبْلِنَا ۚ رَبَّنَا وَلَا تُحَمِّلْنَا مَا لَا طَاقَةَ لَنَا بِهِۦ ۖ وَٱعْفُ عَنَّا وَٱغْفِرْ لَنَا وَٱرْحَمْنَآ ۚ أَنتَ مَوْلَىٰنَا فَٱنصُرْنَا عَلَى ٱلْقَوْمِ ٱلْكَـٰفِرِينَ ٢٨٦",
    "translation": "The Messenger has believed in what has been revealed to him from his Lord, and the believers as well. All have believed in Allah and His angels and His Books and His Messengers. “We make no division between any of His Messengers,” and they have said: “We have listened, and obeyed. Our Lord, (we seek) Your pardon! And to You is the return.”(285) Allah does not obligate anyone beyond his capacity. For him is what he has earned, and on him what he has incurred.“Our Lord, do not hold us accountable, if we forget or make a mistake, and, Our Lord, do not place on us such a burden as You have placed on those before us, and, Our Lord, do not make us bear a burden for which we have no strength. And pardon us, and grant us forgiveness, and have mercy on us. You are our Lord. So then help us against the disbelieving people.” (286) [T. Usmani]",
    "description": "The Prophet ﷺ said, “Whoever reads them in an evening, they will suffice them”",
    "tags": ["Quran", "Mairaj"],
    "referenceLink": "https://quran.com/2/285"
  },
  {
    "id": "q6",
    "title": "Dua for submission to the Qadr of Allah",
    "content": "رَبَّنَا لَا تُزِغْ قُلُوبَنَا بَعْدَ إِذْ هَدَيْتَنَا وَهَبْ لَنَا مِن لَّدُنكَ رَحْمَةً ۚ إِنَّكَ أَنتَ ٱلْوَهَّابُ ٨ رَبَّنَآ إِنَّكَ جَامِعُ ٱلنَّاسِ لِيَوْمٍۢ لَّا رَيْبَ فِيهِ ۚ إِنَّ ٱللَّهَ لَا يُخْلِفُ ٱلْمِيعَادَ ٩",
    "translation": "“Our Lord, do not let our hearts deviate from the right path after You have given us guidance, and bestow upon us mercy from Your own. Surely, You, and You alone, are the One who bestows in abundance.(8) Our Lord, You are going to assemble all the people on a day in (the occurrence of) which there is no doubt. Verily, Allah does not back out of His promise. (9)”",
    "description": "The Holy Prophet ﷺ There is no heart which is not there in between the two of Allah's fingers - He makes it firm on the truth as long as He wills, and turns it away from the truth when He wills. So a believer admits it by heart and always ask Allah SW for not turning down his heart.",
    "tags": ["Quran", "Submission"],
    "referenceLink": "https://quran.com/3/8"
  },
  {
    "id": "q7",
    "title": "The supplication of Al-Mutaaqin",
    "content": "اَلَّذِيۡنَ يَقُوۡلُوۡنَ رَبَّنَاۤ اِنَّنَاۤ اٰمَنَّا فَاغۡفِرۡ لَنَا ذُنُوۡبَنَا وَقِنَا عَذَابَ النَّارِ​ۚ",
    "translation": "Those (are the ones) who say: “Our Lord, surely we have believed, so forgive us our sins and save us from the punishment of the Fire,” — T. Usmani",
    "description": "The Holy Prophet ﷺ There is no heart which is not there in between the two of Allah's fingers - He makes it firm on the truth as long as He wills, and turns it away from the truth when He wills. So a believer admits it by heart and always ask Allah SW for not turning down his heart.",
    "tags": ["Quran", "Submission"],
    "referenceLink": "https://quran.com/3/16"
  },
  {
    "id": "q8",
    "title": "Dua of Followers of Isa A.S",
    "content": "(۵۳) رَبَّنَآ ءَامَنَّا بِمَآ أَنزَلْتَ وَٱتَّبَعْنَا ٱلرَّسُولَ فَٱكْتُبْنَا مَعَ ٱلشَّـٰهِدِين",
    "translation": "“Our Lord, we have believed in what You have revealed, and we have followed the messenger. So, record us with those who bear witness (to the Truth).” — T. Usmani",
    "tags": ["Quran", "Submission"],
    "referenceLink": "https://quran.com/3/53"
  },
  {
    "id": "q9",
    "title": "Dua Prayed by Muslims in the Battle of Uhud",
    "content": "وَمَا كَانَ قَوۡلَهُمۡ اِلَّاۤ اَنۡ قَالُوۡا رَبَّنَا اغۡفِرۡ لَنَا ذُنُوۡبَنَا وَاِسۡرَافَنَا فِىۡۤ اَمۡرِنَا وَ ثَبِّتۡ اَقۡدَامَنَا وَانۡصُرۡنَا عَلَى الۡقَوۡمِ الۡكٰفِرِيۡنَ",
    "translation": "They had nothing else to say except that they said: “Our Lord, forgive us our sins and our excesses in our conduct, make firm our feet and help us against the disbelieving people.” — T. Usmani",
    "tags": ["Quran", "Submission", "Istighfar"],
    "referenceLink": "https://quran.com/3/147"
  },
  {
    "id": "m1",
    "title": "Dua when waking up in the morning",
    "content": "الحَمْدُ لِلهِ الَّذِي أَحْيَانَا بَعْدَ مَا أَمَاتَنَا وَإِلَيْهِ النُّشُورُ",
    "tags": ["Masnoon", "Sleep", "Wakeup"],
    "referenceLink": "https://sunnah.com/bukhari:6312",
    "translation": "ہم سے قبیصہ بن عقبہ نے بیان کیا ، کہا ہم سے سفیان ثوری نے بیان کیا ، ان سے عبدالملک بن عمیر نے ، ان سے ربعی بن حراش نے اور ان سے حضرت حذیفہ بن یمان رضی اللہ عنہ نے بیان کیاکہ نبی کریم صلی اللہ علیہ وسلم جب اپنے بستر پر لیٹتے تو یہ کہتے ” تیرے ہی نام کے ساتھ میں مردہ اور زندہ رہتا ہوں اور جب بیدار ہوتے تو کہتے اسی اللہ کے لئے تمام تعریفیں ہیں جس نے ہمیں زندہ کیا ۔ اس کے بعد کہ اس نے موت طاری کر دی تھی اور اسی کی طرف لوٹنا ہے ۔ قرآن شریف میں جو لفظ ننشزھا ہے اس کا بھی یہی معنی ہے کہ ہم اس کو نکال کر اٹھاتے ہیں ۔"
  },
  {
    "id": "m2",
    "title": "Dua if someone wakes up at night",
    "content": "لَا إِلَهَ إِلَّا اللهُ وَحْدَهُ لَا شَرِيكَ لَهُ ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ ، وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ ، سُبْحَانَ اللهِ وَالْحَمْدُ لِلهِ ، وَلَا إِلَهَ إِلَّا اللهُ وَاللهُ أَكْـبَرُ ، وَلَا حَوْلَ وَلَا قُوَّةَ إِلَّا بِاللهِ الْعَلِيِّ الْعَظِيمِ رَبِّ اغْفِرْ لِي",
    "tags": ["Masnoon", "Sleep"],
    "referenceLink": "https://sunnah.com/abudawud:5060",
    "translation": "Ubadah b. al-Samit reported the Messenger of Allah (May peace be upon him) as saying; If anyone is alarmed while asleep and he says when awakes: \nThere is no god but Allah alone Who has no partner, to whom dominion belongs, to whom praise is due, and who has power over everything (omnipotent). Glory be to Allah, and praise be to Allah, and there is no god but Allah, and then he prays: O my Lord, forgive me. Abu Dawud said : Al-Walid’s version has; and he prays, his prayer will be answered. If he gets up, performs ablution, and prays, his prayer will be accepted."
  },
  {
    "id": "m3",
    "title": "Dua when waking up in the morning",
    "content": "الْحَمْدُ لِلَّهِ الَّذِي عَافَانِي فِي جَسَدِي وَرَدَّ عَلَىَّ رُوحِي وَأَذِنَ لِي بِذِكْرِهِ",
    "tags": ["Masnoon", "Sleep", "Wakeup"],
    "referenceLink": "https://sunnah.com/tirmidhi:3401",
    "translation": "All praise is for Allah who restored to me my health and returned my soul and has allowed me to remember Him."
  },
  {
    "id": "m4",
    "title": "Dua when seeing a bad dream",
    "content": "أَعُوذُ بِاللهِ مِنَ الشَّيْطَانِ الرَّجِيمِ",
    "tags": ["Masnoon", "Sleep", "Dream"],
    "referenceLink": "https://sunnah.com/bukhari:3292",
    "translation": "The Prophet (ﷺ) said, A good dream is from Allah, and a bad or evil dream is from Satan; so if anyone of you has a bad dream of which he gets afraid, he should spit on his left side and should seek Refuge with Allah from its evil, for then it will not harm him."
  },
  {
    "id": "m5",
    "title": "Dua when putting a garment",
    "content": "الحَمْدُ لِلهِ الَّذِي كَسَانِي هَذَا الثَّوْبَ وَرَزَقَنِيهِ مِنْ غَيْرِ حَوْلٍ مِنِّي وَلَا قُوَّةٍ",
    "tags": ["Masnoon", "Dress"],
    "referenceLink": "https://sunnah.com/abudawud:4023",
    "translation": "The Prophet (ﷺ) said: If anyone puts on a garment and says: \"Praise be to Allah Who has clothed me with this and provided me with it through no might and power on my part,\" he will be forgiven his former and later sins."
  },
  {
    "id": "m6",
    "title": "Dua when eating the food",
    "content": "الْحَمْدُ لِلَّهِ الَّذِي أَطْعَمَنِي هَذَا الطَّعَامَ وَرَزَقَنِيهِ مِنْ غَيْرِ حَوْلٍ مِنِّي وَلاَ قُوَّةٍ",
    "tags": ["Masnoon", "Food", "Eating"],
    "referenceLink": "https://sunnah.com/abudawud:4023",
    "translation": "The Prophet (ﷺ) said: If anyone eats food and then says: \"Praise be to Allah Who has fed me with this food and provided me with it through no might and power on my part,\" he will be forgiven his former and later sins."
  },
  {
    "id": "m7",
    "title": "Dua before undressing",
    "content": "بِسمِ الله",
    "tags": ["Masnoon", "Dress"],
    "referenceLink": "https://sunnah.com/tirmidhi:606",
    "translation": "Ali bin Abi Talid (may Allah be pleased with him) narrated that: \nThe Messenger of Allah said: \"The screen between the eyes of the jinns and nakedness of the children of Adam when one of you enters the area of relieving oneself is saying: 'Bismillah.'\""
  },
  {
    "id": "m8",
    "title": "Dua before entering the toilet",
    "content": "اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الْخُبُثِ وَالْخَبَائِثِ",
    "tags": ["Masnoon", "Toilet"],
    "referenceLink": "https://sunnah.com/muslim:375a",
    "translation": "When the Messenger of Allah (ﷺ) entered the privy, and in the hadith transmitted by Hushaim (the words are): When the Messenger of Allah (ﷺ) entered the lavatory, be used to say: O Allah, I seek refuge in Thee from wicked and noxious things."
  },
  {
    "id": "m9",
    "title": "Dua after leaving the toilet",
    "content": "غُفْرَانَكَ",
    "tags": ["Masnoon", "Toilet"],
    "referenceLink": "https://sunnah.com/abudawud:30",
    "translation": "When the Prophet (ﷺ) came out of the privy, he used to say: \"Grant me Thy forgiveness.\""
  },
  {
    "id": "m10",
    "title": "Dua before starting Wudu",
    "content": "بِسْمِ اللهِ",
    "tags": ["Masnoon", "Wudu"],
    "referenceLink": "https://sunnah.com/ibnmajah:398",
    "translation": "It was narrated that Abu Sa'eed bin Zaid said:\"The Messenger of Allah said: 'There is no prayer for one who does not have ablution, and there is no ablution for one who does not mention the Name of Allah (before it).\""
  },
  {
    "id": "m11",
    "title": "Dua afer performing Wudu",
    "content": "أَشْهَدُ أَنْ لَا إِلَهَ إِلَّا اللَّهُ وَحْدَهُ لَا شَرِيكَ لَهُ، وَأَشْهَدُ أَنَّ مُحَمَّدًا عَبْدُهُ وَرَسُولُهُ, ،اللَّهُمَّ اجْعَلْنِي مِنَ التَّوَّابِينَ، وَاجْعَلْنِي مِنَ المُتَطَهِّرِينَ",
    "tags": ["Masnoon", "Wudu"],
    "referenceLink": "https://sunnah.com/tirmidhi:55",
    "translation": "Allah's Messenger said: Whoever performs Wudu, making Wudu well, then says: (\"Ashhadu an la ilaha illallah, wahdahu la sharika lahu, wa ashhadu anna Muhammadan-abduhu wa rasuluhu, Allahummajalni minat tawwabin, waj'alni minal mutatahhirin\") 'I testify that none has the right to be worshipped but Allah Alone, there are no partners for Him. And I testify that Muhammad is His servant and Messenger. O Allah! Make me among the repentant, and make me among those who purify themselves.' Then eight gates of Paradise are opened for him, that may enter by whichever of them wishes."
  },
  {
    "id": "m12",
    "title": "Dua before leaving the house",
    "content": "بِسْمِ اللهِ ، تَوَكَّلْتُ عَلَى اللهِ وَلَا حَوْلَ وَلَا قُوَّةَ إِلَّا بِاللهِ",
    "tags": ["Masnoon", "House"],
    "referenceLink": "https://sunnah.com/abudawud:5095",
    "translation": "The Prophet (ﷺ) said: When a man goes out of his house and says: \"In the name of Allah, I trust in Allah; there is no might and no power but in Allah,\" the following will be said to him at that time: \"You are guided, defended and protected.\" The devils will go far from him and another devil will say: How can you deal with a man who has been guided, defended and protected?"
  },
  {
    "id": "m13",
    "title": "Dua before leaving the house",
    "content": "اللَّهُمَّ إِنِّي أَعُوذُ بِكَ أَنْ أَضِلَّ أَوْ أُضَلَّ أَوْ أَزِلَّ أَوْ أُزَلَّ أَوْ أَظْلِمَ أَوْ أُظْلَمَ أَوْ أَجْهَلَ أَوْ يُجْهَلَ عَلَىَّ",
    "tags": ["Masnoon", "House"],
    "referenceLink": "https://sunnah.com/abudawud:5095",
    "translation": "The Messenger of Allah (ﷺ) never went out of my house without raising his eye to the sky and saying: \"O Allah! I seek refuge in Thee lest I stray or be led astray, or slip or made to slip, or cause injustice, or suffer injustice, or do wrong, or have wrong done to me.\""
  },
  {
    "id": "m14",
    "title": "Dua when setting out for Mosque",
    "content": "اللَّهُمَّ اجْعَلْ فِي قَلْبِي نُورًا ، وَفِي لِسَانِي نُورًا ، وَاجْعَلْ فِي سَمْعِي نُورًا ، وَاجْعَلْ فِي بَصَرِي نُورًا ، وَاجْعَلْ مِنْ خَلْفِي نُورًا ، وَمِنْ أَمَامِي نُورًا ، وَاجْعَلْ مِنْ فَوْقِي نُورًا ، وَمِنْ تَحْتِي نُورًا ، اللَّهُمَّ أَعْطِنِي نُورًا",
    "tags": ["Masnoon", "Mosque"],
    "referenceLink": "https://sunnah.com/muslim:763l",
    "translation": "He spent (one night) in the house of the Messenger of Allah (ﷺ). He (the Holy Prophet) got up, brushed his teeth and performed ablution and said: \"In the creation of the heavens and the earth, and the alternation of the night and the day, there are indeed signs for people of understanding\" (al-Qur'an, iii. 190), to the end of the Surah. He then stood up and prayed two rak`ahs, standing, bowing and prostrating himself at length in them. Then he finished, went to sleep and snored. He did that three times, six rak`ahs altogether, each time cleaning his teeth, performing ablution, and reciting these verses. Then he observed three rak`ahs of Witr. The Mu'adhdhin then pronounced the Adhan and he went out for prayer and was saying: \"O Allah! place light in my heart, light in my tongue, place light in my hearing, place light in my eyesight, place light behind me, and light in front of me, and place light above me, and light below me. O Allah! grant me light.\""
  },
  {
    "id": "m15",
    "title": "Dua when entering the Mosque",
    "content": "أَعُوذُ بِاللَّهِ الْعَظِيمِ وَبِوَجْهِهِ الْكَرِيمِ وَسُلْطَانِهِ الْقَدِيمِ مِنَ الشَّيْطَانِ الرَّجِيمِ",
    "tags": ["Masnoon", "Mosque"],
    "referenceLink": "https://sunnah.com/abudawud:466",
    "translation": "I met ‘Uqbah b. Muslim and said to him: it has been reported to me that someone has narrated to you from the prophet (ﷺ) that when he entered the mosque, he would say: I seek refuge in Allah, the Magnificent, and in His noble face, and in his eternal domain, from the accursed Devil. He asked : is it so much only? I said: Yes. He said: when anyone says so. The devil says: he is protected from me all the day long."
  },
  {
    "id": "m16",
    "title": "Dua when entering the Mosque",
    "content": "السَّلامُ عَلَى رَسُولِ الله,اللَّهُمَّ افْتَحْ لِي أَبْوَابَ رَحْمَتِكَ",
    "tags": ["Masnoon", "Mosque"],
    "referenceLink": "https://sunnah.com/abudawud:465",
    "translation": "Abu Usaid al-Ansari reported the Messenger of Allah (May peace be upon him) as saying: when any of you enters the mosque he should invoke blessing on the prophet (ﷺ) and then he should say: O Allah, open to me the gates of thy mercy."
  },
  {
    "id": "m17",
    "title": "Dua when leaving the Mosque",
    "content": "السَّلامُ عَلَى رَسُولِ الله,اللَّهُمَّ إِنِّي أَسْأَلُكَ مِنْ فَضْلِكَ",
    "tags": ["Masnoon", "Mosque"],
    "referenceLink": "https://sunnah.com/abudawud:465",
    "translation": "Abu Usaid al-Ansari reported the Messenger of Allah (May peace be upon him) as saying: when any of you enters the mosque he should invoke blessing on the prophet (ﷺ) and then he should say: O Allah, open to me the gates of thy mercy."
  },
  {
    "id": "m18",
    "title": "Dua while hearing the Adhan",
    "content": "تَقُولُ اللَّهُ أَكْبَرُ اللَّهُ أَكْبَرُ اللَّهُ أَكْبَرُ اللَّهُ أَكْبَرُ تَرْفَعُ بِهَا صَوْتَكَ ثُمَّ تَقُولُ أَشْهَدُ أَنْ لاَ إِلَهَ إِلاَّ اللَّهُ أَشْهَدُ أَنْ لاَ إِلَهَ إِلاَّ اللَّهُ أَشْهَدُ أَنَّ مُحَمَّدًا رَسُولُ اللَّهِ أَشْهَدُ أَنَّ مُحَمَّدًا رَسُولُ اللَّهِ تَخْفِضُ بِهَا صَوْتَكَ ثُمَّ تَرْفَعُ صَوْتَكَ بِالشَّهَادَةِ أَشْهَدُ أَنْ لاَ إِلَهَ إِلاَّ اللَّهُ أَشْهَدُ أَنْ لاَ إِلَهَ إِلاَّ اللَّهُ أَشْهَدُ أَنَّ مُحَمَّدًا رَسُولُ اللَّهِ أَشْهَدُ أَنَّ مُحَمَّدًا رَسُولُ اللَّهِ حَىَّ عَلَى الصَّلاَةِ حَىَّ عَلَى الصَّلاَةِ حَىَّ عَلَى الْفَلاَحِ حَىَّ عَلَى الْفَلاَحِ فَإِنْ كَانَ صَلاَةَ الصُّبْحِ قُلْتَ الصَّلاَةُ خَيْرٌ مِنَ النَّوْمِ الصَّلاَةُ خَيْرٌ مِنَ النَّوْمِ اللَّهُ أَكْبَرُ اللَّهُ أَكْبَرُ لاَ إِلَهَ إِلاَّ اللَّهُ",
    "tags": ["Masnoon", "Adhan"],
    "referenceLink": "https://sunnah.com/abudawud:500",
    "translation": "Abu Mahdhurah reported; I said; Messenger of Allah, teach me the method of ADHAN (how to pronounce the call to prayer). He wiped my forehead (with his hand) and asked me to pronounce; Allah is most great. Allah is most great. Allah is most great. Allah is most great, raising your voice while saying them (these words). Then you must raise your voice in making the testimony: I testify that there is no god but Allah, I testify that there is no god but Allah; I testify that Muhammad is the Messenger of Allah, I testify that Muhammad is the Messenger of Allah. Lowering your voice while saying them (these words). Then you must raise your voice in making the testimony: I testify that there is no god but Allah, I testify there is no god but Allah; I testify Muhammad is the Messenger of Allah, I testify Muhammad is the Messenger of Allah. Come to prayer, come to prayer; come to salvation, come to salvation. If it is the morning prayer, you must pronounce; prayer is better than sleep, prayer is better than sleep, Allah is most great; there is no god but Allah."
  },
  {
    "id": "m19",
    "title": "Dua after hearing the Adhan 1",
    "content": "أَشْهَدُ أَنْ لاَ إِلَهَ إِلاَّ اللَّهُ وَحْدَهُ لاَ شَرِيكَ لَهُ وَأَشْهَدُ أَنَّ مُحَمَّدًا عَبْدُهُ وَرَسُولُهُ رَضِيتُ بِاللَّهِ رَبًّا وَبِمُحَمَّدٍ رَسُولاً وَبِالإِسْلاَمِ دِينًا",
    "tags": ["Masnoon", "Adhan"],
    "referenceLink": "https://sunnah.com/abudawud:525",
    "translation": "Sa’d b. Abi Waqqas reported the Messenger of Allah (May peace be upon him) as saying: If anyone says when he hears the MU’ADHDHIN : “And I testify that there is no god but Allah alone who has no partner and that Muhammad is His servant and Apostle: I am satisfied with Allah as lord, with Muhammad as apostle and with Islam as religion”, he will be forgiven."
  },
  {
    "id": "m20",
    "title": "Dua after hearing the Adhan 2",
    "content": "اللَّهُمَّ صَلِّ عَلَى مُحَمَّدٍ وَعَلَى آلِ مُحَمَّدٍ، كَمَا صَلَّيْتَ عَلَى آلِ إِبْرَاهِيمَ، إِنَّكَ حَمِيدٌ مَجِيدٌ، اللَّهُمَّ بَارِكْ عَلَى مُحَمَّدٍ وَعَلَى آلِ مُحَمَّدٍ، كَمَا بَارَكْتَ عَلَى آلِ إِبْرَاهِيمَ، إِنَّكَ حَمِيدٌ مَجِيدٌ",
    "tags": ["Masnoon", "Adhan"],
    "referenceLink": "https://sunnah.com/bukhari/65",
    "translation": "Narrated Ka`b bin Ujra: It was said, \"O Allah's Messenger (ﷺ)! We know how to greet you, but how to invoke Allah for you?\" The Prophet said, \"Say: Allahumma salli ala Muhammadin wa'ala `Ali Muhammaddin, kama sallaita 'ala all Ibrahim, innaka Hamidun Majid.\""
  },
  {
    "id": "m21",
    "title": "Dua after hearing the Adhan 3",
    "content": " اللَّهُمَّ رَبَّ هَذِهِ الدَّعْوَةِ التَّامَّةِ وَالصَّلاَةِ الْقَائِمَةِ آتِ مُحَمَّدًا الْوَسِيلَةَ وَالْفَضِيلَةَ وَابْعَثْهُ مَقَامًا مَحْمُودًا الَّذِي وَعَدْتَهُ",
    "tags": ["Masnoon", "Adhan"],
    "referenceLink": "https://sunnah.com/abudawud/2",
    "translation": "Jabir b. ‘Abd Allah reported the Messenger of Allah (ﷺ) as saying: if anyone says when he hears the call to prayer : “O Allah, Lord of this perfect call and of the prayer which is established for all time, grant Muhammad the wasilah and excellency, and raise him up in a praiseworthy position which Thou hast promised, he will be assured of my intercession."
  },
  {
    "id": "m22",
    "title": "Dua before sleeping",
    "content": "اللَّهُمَّ قِنِي عَذَابَكَ يَوْمَ تَبْعَثُ عِبَادَكَ",
    "tags": ["Masnoon", "Sleep"],
    "referenceLink": "https://sunnah.com/abudawud:5045",
    "translation": "When the Messenger of Allah (ﷺ) wanted to go to sleep, he put his right hand under his cheek and would then say three times: O Allah, guard me from Thy punishment on the day when Thou raisest up Thy servants."
  },
  {
    "id": "m23",
    "title": "Dua Qunoot (In Witar)",
    "content": "اللَّهُمَّ اهْدِنِي فِيمَنْ هَدَيْتَ وَعَافِنِي فِيمَنْ عَافَيْتَ وَتَوَلَّنِي فِيمَنْ تَوَلَّيْتَ وَبَارِكْ لِي فِيمَا أَعْطَيْتَ وَقِنِي شَرَّ مَا قَضَيْتَ إِنَّكَ تَقْضِي وَلاَ يُقْضَى عَلَيْكَ وَإِنَّهُ لاَ يَذِلُّ مَنْ وَالَيْتَ وَلاَ يَعِزُّ مَنْ عَادَيْتَ تَبَارَكْتَ رَبَّنَا وَتَعَالَيْتَ",
    "tags": ["Masnoon", "Prayer", "Witar"],
    "referenceLink": "https://sunnah.com/abudawud:1425",
    "translation": "The Messenger of Allah (ﷺ) taught me some words that I say during the witr. (The version of Ibn Jawwas has: I say them in the supplication of the witr.) They were: \"O Allah, guide me among those Thou hast guided, grant me security among those Thou hast granted security, take me into Thy charge among those Thou hast taken into Thy charge, bless me in what Thou hast given, guard me from the evil of what Thou hast decreed, for Thou dost decree, and nothing is decreed for Thee. He whom Thou befriendest is not humbled. Blessed and Exalted art Thou, our Lord.\""
  },
  {
    "id": "m24",
    "title": "Dua afer witar prayer",
    "content": "سُبْحَانَ الْمَلِكِ الْقُدُّوسِ",
    "tags": ["Masnoon", "Prayer", "Witar"],
    "referenceLink": "https://sunnah.com/nasai:1730",
    "translation": "Ubayy bin Ka'b said: \"The Messenger of Allah (ﷺ) used to recite in Witr: \"Glorify the Name of your Lord, the Most High;\" and \"Say: O you disbelievers!;' and 'Say: He is Allah, (the) One.'\""
  },
  {
    "id": "m25",
    "title": "Dua for anxiety and sorrow",
    "content": "اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الْهَمِّ وَالْحَزَنِ وَالْعَجْزِ وَالْكَسَلِ وَالْبُخْلِ وَالْجُبْنِ وَضَلَعِ الدَّيْنِ وَغَلَبَةِ الرِّجَالِ",
    "tags": ["Masnoon", "Sorrow", "Anxiety"],
    "referenceLink": "https://sunnah.com/bukhari:2893",
    "translation": "Narrated Anas bin Malik: The Prophet (ﷺ) said to Abu Talha, \"Choose one of your boy servants to serve me in my expedition to Khaibar.\" So, Abu Talha took me letting me ride behind him while I was a boy nearing the age of puberty. I used to serve Allah's Messenger (ﷺ) when he stopped to rest. I heard him saying repeatedly, \"O Allah! I seek refuge with You from distress and sorrow, from helplessness and laziness, from miserliness and cowardice, from being heavily in debt and from being overcome by men.\""
  },
  {
    "id": "m26",
    "title": "Dua for distress",
    "content": "اللَّهُمَّ رَحْمَتَكَ أَرْجُو فَلاَ تَكِلْنِي إِلَى نَفْسِي طَرْفَةَ عَيْنٍ وَأَصْلِحْ لِي شَأْنِي كُلَّهُ لاَ إِلَهَ إِلاَّ أَنْتَ",
    "tags": ["Masnoon", "Sorrow", "Distress"],
    "referenceLink": "https://sunnah.com/abudawud:5090",
    "translation": "Narrated Abubakrah: The Messenger of Allah (ﷺ) said: The supplications to be used by one who is distressed are: \"O Allah! Thy mercy is what I hope for. Do not abandon me to myself for an instant, but put all my affairs in good order for me. There is no god but Thou.\""
  },
  {
    "id": "m27",
    "title": "Dua when afflicted with doubt in faith",
    "content": "آمَنْتُ بِاللهِ وَرُسُلِهِ",
    "tags": ["Masnoon", "Danger", "Faith"],
    "referenceLink": "https://sunnah.com/muslim:134b",
    "translation": "It is narrated on the authority of Abu Huraira that the Messenger of Allah (ﷺ) said: Men will continue to question one another till this is propounded: Allah created all things but who created Allah? He who found himself confronted with such a situation should say: I affirm my faith in Allah."
  },
  {
    "id": "m28",
    "title": "Dua when afflicted with doubt in faith 2",
    "content": "هُوَ الأَوَّلُ وَالآخِرُ وَالظَّاهِرُ وَالْبَاطِنُ وَهُوَ بِكُلِّ شَىْءٍ عَلِيمٌ",
    "tags": ["Masnoon", "Danger", "Faith"],
    "referenceLink": "https://sunnah.com/muslim:134b",
    "translation": "Narrated Abdullah ibn Abbas: AbuZumayl said: I asked Ibn Abbas, saying: What is that I find in my breast? He asked: What is it? I replied: I swear by Allah, I cannot speak about it. He asked me: Is it something doubtful? and he laughed. He then said: No one could escape that, until Allah, the exalted, revealed: \"If thou went in doubt as to what we have revealed unto thee, and ask those who have been reading the Book from before thee.\" He said: If you find something in your heart, say: He is the first and the Last, the Evident and the Immanent, and He has full knowledge of all things."
  },
  {
    "id": "m29",
    "title": "Dua when afflicted by whisperings of the devil in prayer or recitation",
    "content": "أَعُوذُ بِاللهِ مِنَ الشَّيْطَانِ الرَّجِيمِ",
    "tags": ["Masnoon", "Prayer", "Devil"],
    "referenceLink": "https://sunnah.com/muslim:2203a",
    "translation": "Uthman b. Abu al-'As reported that he came to Allah's Messenger (ﷺ) and said: Allah's Messenger, the Satan intervenes between me and my prayer and my reciting of the Qur'an and he confounds me. Thereupon Allah's Messenger (ﷺ) said:, That is (the doing of a) Satan (devil) who is known as Khinzab, and when you perceive its effect, seek refuge with Allah from it and spit three times to your left. I did that and Allah dispelled that from me."
  },
  {
    "id": "m30",
    "title": "Dua when struck with a calamity or when unable to do something",
    "content": "قَدَرُ اللَّهِ وَمَا شَاءَ فَعَلَ",
    "tags": ["Masnoon", "Calamity", "Devil"],
    "referenceLink": "https://sunnah.com/muslim:2664",
    "translation": "Abu Huraira reported Allah's Messenger (ﷺ) as saying: A strong believer is better and is more lovable to Allah than a weak believer, and there is good in everyone, (but) cherish that which gives you benefit (in the Hereafter) and seek help from Allah and do not lose heart, and if anything (in the form of trouble) comes to you, don't say: If I had not done that, it would not have happened so and so, but say: Allah did that what He had ordained to do and your\" if\" opens the (gate) for the Satan."
  },
  {
    "id": "m31",
    "title": "Dua between Takbir-e-Tehreema and Qirat",
    "content": "اللَّهُمَّ بَاعِدْ بَيْنِي وَبَيْنَ خَطَايَاىَ كَمَا بَاعَدْتَ بَيْنَ الْمَشْرِقِ وَالْمَغْرِبِ، اللَّهُمَّ نَقِّنِي مِنَ الْخَطَايَا كَمَا يُنَقَّى الثَّوْبُ الأَبْيَضُ مِنَ الدَّنَسِ، اللَّهُمَّ اغْسِلْ خَطَايَاىَ بِالْمَاءِ وَالثَّلْجِ وَالْبَرَدِ",
    "tags": ["Masnoon", "Prayer"],
    "referenceLink": "https://sunnah.com/bukhari:744",
    "translation": "Narrated Abu Huraira: Allah's Messenger (ﷺ) used to keep silent between the Takbir and the recitation of Qur'an and that interval of silence used to be a short one. I said to the Prophet (ﷺ) \"May my parents be sacrificed for you! What do you say in the pause between Takbir and recitation?\" The Prophet (ﷺ) said, \"I say, 'Allahumma, baa`id baini wa baina khatayaya kama baa`adta baina l-mashriqi wa l-maghrib. Allahumma, naqqini min khatayaya kama yunaqqa th-thawbu l-abyadu mina d-danas. Allahumma, ighsil khatayaya bi l-maa'i wa th-thalji wa l-barad (O Allah! Set me apart from my sins (faults) as the East and West are set apart from each other and clean me from sins as a white garment is cleaned of dirt (after thorough washing). O Allah! Wash off my sins with water, snow and hail.)\""
  },
  {
    "id": "m30",
    "title": "Dua after Sanaah or before Fateha",
    "content": "أَعُوذُ بِاللَّهِ السَّمِيعِ الْعَلِيمِ مِنَ الشَّيْطَانِ الرَّجِيمِ مِنْ هَمْزِهِ وَنَفْخِهِ وَنَفْثِهِ",
    "tags": ["Masnoon", "Prayer"],
    "referenceLink": "https://sunnah.com/abudawud:775",
    "translation": "Narrated AbuSa'id al-Khudri: When the Messenger of Allah (ﷺ) got up to pray at night (for tahajjud prayer) he uttered the takbir and then said: \"Glory be to Thee, O Allah,\" and \"Praise be to Thee\" and \"Blessed is Thy name,\" and Exalted is Thy greatness.\" and \"There is no god but Thee.\" He then said: \"There is no god but Allah\" three times; he then said: \"Allah is altogether great\" three times: \"I seek refuge in Allah, All-Hearing and All-Knowing from the accursed devil, from his evil suggestion (hamz), from his puffing up (nafkh), and from his spitting (nafth)\" He then recited (the Qur'an). Abu Dawud said: It is said that this tradition has been narrated by 'Ali b. 'Ali from al-Hasan omitting the name of the Companion of the Prophet (ﷺ). The misunderstanding occurred on the part of Ja'far."
  },
  {
    "id": "m31",
    "title": "Dua in Rukooh or Sajdah",
    "content": "سُبْحَانَكَ اللَّهُمَّ رَبَّنَا وَبِحَمْدِكَ، اللَّهُمَّ اغْفِرْ لِي",
    "tags": ["Masnoon", "Prayer"],
    "referenceLink": "https://sunnah.com/bukhari:794",
    "translation": "Narrated `Aisha: The Prophet (ﷺ) used to say in his bowing and prostrations, \"Subhanaka l-lahumma Rabbana wa bihamdika; Allahumma ghfir li.\" (Exalted [from unbecoming attributes] Are you O Allah our Lord, and by Your praise [do I exalt you]. O Allah! Forgive me)."
  },
  {
    "id": "m32",
    "title": "Dua in Rukooh or Sajdah 2",
    "content": "سُبـّوحٌ قُـدّوس، رَبُّ الملائِكَـةِ وَالـرُّوح",
    "tags": ["Masnoon", "Prayer"],
    "referenceLink": "https://sunnah.com/riyadussalihin:1426",
    "translation": "Aishah (May Allah be pleased with her) reported: The Messenger of Allah (ﷺ) used to recite in his bowing and prostration: \"Subbuhun Quddusun, Rabbul-mala'ikati war-ruh\" [You are the Most Glorious. The Most Holy. You the Rubb of the angels and of Jibril]"
  },
  {
    "id": "m33",
    "title": "Dua after Rukooh (Qoma)",
    "content": "رَبَّنَا وَلَكَ الْحَمْدُ، حَمْدًا كَثِيرًا طَيِّبًا مُبَارَكًا فِيهِ",
    "tags": ["Masnoon", "Prayer"],
    "referenceLink": "https://sunnah.com/bukhari:799",
    "translation": "Narrated Rifa`a bin Rafi` Az-Zuraqi: One day we were praying behind the Prophet. When he raised his head from bowing, he said, \"Sami`a l-lahu liman hamidah.\" A man behind him said, \"Rabbana wa laka l-hamdu, hamdan kathiran taiyiban mubarakan fihi\" (O our Lord! All the praises are for You, many good and blessed praises). When the Prophet completed the prayer, he asked, \"Who has said these words?\" The man replied, \"I.\" The Prophet said, \"I saw over thirty angels competing to write it first.\" Prophet rose (from bowing) and stood straight till all the vertebrae of his spinal column came to a natural position."
  },
  {
    "id": "m34",
    "title": "Dua between 2 Prostrations",
    "content": "اللّهُـمَّ اغْفِـرْ لي، وَارْحَمْـني، وَاهْدِنـي، وَاجْبُرْنـي، وَعافِنـي وَارْزُقْنـي وَارْفَعْـني",
    "tags": ["Masnoon", "Prayer"],
    "referenceLink": "https://sunnah.com/hisn:49",
    "translation": "Allāhumma’ghfir lī, war’ḥamnī, wahdinī, wajburnī, wa `āfinī, warzuqnī, warfa`nī. O Allah forgive me, have mercy on me, guide me, support me, protect me, provide for me, and elevate me."
  },
  {
    "id": "m35",
    "title": "Dua after Tashud",
    "content": "اللهم إني أعوذ بك من عذاب جهنم، ومن عذاب القبر ومن فتنة المحيا والممات، ومن شر فتنة المسيح الدجال",
    "tags": ["Masnoon", "Prayer"],
    "referenceLink": "https://sunnah.com/riyadussalihin:1423",
    "translation": "Abu Hurairah (May Allah be pleased with him) reported: The Messenger of Allah (ﷺ) said, \"When anyone of you has done his Tashahhud during Salat (prayer), he should seek refuge in Allah against four things and say: \"Allahumma inni a'udhu bika min 'adhabi jahannam, wa min 'adhabil-qabr, wa min fitnatil-mahya wal-mamat, wa min sharri fitnatil-masihid-dajjal (O Allah! I seek refuge in You from the torment of Hell, from the torment of the grave, from the trials of life and death, and from the mischief of Al-Masih Ad-Dajjal (Antichrist).\""
  },
  {
    "id": "m36",
    "title": "Dua after Tashud and before Salam",
    "content": "اللّهُـمَّ أَعِـنِّي عَلـى ذِكْـرِكَ وَشُكْـرِك ،وَحُسْـنِ عِبـادَتِـك",
    "tags": ["Masnoon", "Prayer"],
    "referenceLink": "https://sunnah.com/hisn:59",
    "translation": "O Allah, help me to remember You, to give You thanks, and to perform Your worship in the best manner."
  },
  {
    "id": "m37",
    "title": "Dua after each gathering with useless talks",
    "content": "سبحانك اللهم وبحمدك، أشهد أن لا إله إلا أنت، أستغفرك وأتوب إليك",
    "tags": ["Masnoon", "Gathering"],
    "referenceLink": "https://sunnah.com/riyadussalihin:831",
    "translation": "Abu Hurairah (May Allah be pleased with him) reported: Messenger of Allah (ﷺ) said, \"Whoever sits in a gathering and indulges in useless talk and before getting up supplicates: 'Subhanaka Allahumma wa bihamdika, ash-hadu an la ilaha illa Anta, astaghfiruka wa atubu ilaika (O Allah, You are free from every imperfection; praise be to You. I testify that there is no true god except You; I ask Your Pardon and turn to You in repentance),' he will be forgiven for (the sins he may have intentionally or unintentionally committed) in that assembly.\""
  },
  {
    "id": "m38",
    "title": "Most freequent supplication of Prophet Muhammad (SAW)",
    "content": "يا مقلب القلوب ثبت قلبي على دينك",
    "tags": ["Masnoon", "Supplication"],
    "referenceLink": "https://sunnah.com/riyadussalihin:1489",
    "translation": "Shahr bin Haushab reported: I asked Umm Salamah (May Allah be pleased with her), \"O Mother of the Believers! Which supplication did the Messenger of Allah (ﷺ) make frequently when he was in your house?\" She said: \"He (ﷺ) supplicated frequently: 'Ya muqallibal-qulubi, thabbit qalbi 'ala dinika (O Controller of the hearts make my heart steadfast in Your religion).\""
  },
  {
    "id": "m39",
    "title": "Dua for Protection from Evil Eye and Jinn",
    "content": "أَعُوذُ بِکَلِمَاتِ اللَّهِ التَّامَّاتِ الَّتِی لَا یُجَاوِزُھُنَّ بَرٌّ وَلَا فَجِرٌ مِّنْ شَرِّ مَاخَلَقَ وَ ذَرَأَ وَ بَرَأَ وَ مِنْ شَرِّ مَا یَنْزِلُ مِنَ السَّمَاءِ وَ مِنْ شَرِّ مَا یَعْرُجُ فِیھَا وَ مِنْ شَرِّ مَا ذَرَأَ فِی الْأَرْضِ وَ مِن شَرِّ مَا یَخْرُجُ مِنْھَا وَ مِنْ شَرِّ فِتَنِ اللَّیْلِ وَ النَّھَارِ وَ مِنْ شَرِّ کُلِّ طَارِقٍ إِلَّا یَطْرُقُ بِخَیْرٍ یَا رَحْمَنُ ۔آمِیْنْ",
    "tags": ["Masnoon", "Protection", "Jinn", "Supplication"],
    "referenceLink": "https://www.ahlesunnatpak.com/hadith-details/musnad_ahmed/88",
    "translation": "Abu Tiyah narrates that he asked Abdul Rahman bin Khunbash Tamimi: What did the Messenger of Allah (ﷺ) do on the night when the devils came close to him? He said: On that night, the devils attacked the Prophet (ﷺ) from various valleys and mountains. Among them was a devil holding a flame of fire, intending to burn the face of the Messenger of Allah (ﷺ). But he was overawed and retreated. Ja'far, the narrator, said that he stepped back. At that moment, Jibreel (Gabriel) came and said: O Muhammad! Say. The Prophet (ﷺ) asked: What should I say? He said: Recite this supplication: \"I seek refuge in the perfect words of Allah, which neither the righteous nor the wicked can surpass, from the evil of what He has created, from the evil of what descends from the sky, from the evil of what ascends to it, from the evil of the trials of the night and the day, and from the evil of every visitor except one who comes with good, O Most Merciful.\" (As a result) the devils' fire was extinguished, and Allah, the Exalted, defeated them."
  },
  {
    "id": "m40",
    "title": "Seeking protection from the Anger of Allah(SW) and His creatures",
    "content": "أَعُوذُ بِكَلِمَاتِ اللَّهِ التَّامَّةِ مِنْ غَضَبِهِ وَعِقَابِهِ وَشَرِّ عِبَادِهِ وَمِنْ هَمَزَاتِ الشَّيَاطِينِ وَأَنْ يَحْضُرُونِ",
    "tags": ["Masnoon", "Protection", "Jinn", "Supplication"],
    "referenceLink": "https://sunnah.com/malik/51/9",
    "translation": "Yahya related to me from Malik that Yahya ibn Said said that he had heard that Khalid ibn al-Walid said to the Messenger of Allah, may Allah bless him and grant him peace, \"I have nightmares.\" The Messenger of Allah, may Allah bless him and grant him peace, said to him, \"Say, 'I seek refuge with the complete words of Allah from His anger and His punishment and the evil of His slaves, and from the evil suggestions of the shayatin and from their being present (at death).' \""
  },
  {
    "id": "m41",
    "title": "Supplement for sick person / Dua for visiting a patient",
    "content": "بِسْمِ اللَّهِ أَرْقِيكَ مِنْ كُلِّ شَىْءٍ يُؤْذِيكَ مِنْ شَرِّ كُلِّ نَفْسٍ أَوْ عَيْنٍ أَوْ حَاسِدٍ اللَّهُ يَشْفِيكَ بِسْمِ اللَّهِ أَرْقِيكَ",
    "tags": ["Masnoon", "Protection", "Sickness", "Supplication"],
    "referenceLink": "https://sunnah.com/malik/51/9",
    "translation": "It was narrated from Abu Sa’eed that Jibra’il came to the Prophet (ﷺ) and said: “O Muhammad, you are ill. He said: ‘Yes.’ He said: Bismillahi arqika, min kulli shay’in yu’dhika, min sharri kulli nafsin aw ‘aynin aw hasidin. Allahu yashfika, bismillahi arqika (In the Name of Allah I perform Ruqyah for you, from everything that is harming you, from the evil of every soul or envious eye, may Allah heal you. In the Name of Allah I perform Ruqyah for you)."
  },
  {
    "id": "m42",
    "title": "Dua of Ibrahim A.S for seeking refuge of Allah SW",
    "content": "أَعُوذُ بِكَلِمَاتِ اللَّهِ التَّامَّةِ مِنْ كُلِّ شَيْطَانٍ وَهَامَّةٍ، وَمِنْ كُلِّ عَيْنٍ لاَمَّةٍ",
    "tags": ["Masnoon", "Protection", "Supplication"],
    "referenceLink": "https://sunnah.com/bukhari:3371",
    "translation": "Narrated Ibn `Abbas: The Prophet (ﷺ) used to seek Refuge with Allah for Al-Hasan and Al-Husain and say: \"Your forefather (i.e. Abraham) used to seek Refuge with Allah for Ishmael and Isaac by reciting the following: 'O Allah! I seek Refuge with Your Perfect Words from every devil and from poisonous pests and from every evil, harmful, envious eye.'\""
  },
  {
    "id": "m43",
    "title": "Dua when visiting a graveyard",
    "content": "قُولِي السَّلاَمُ عَلَى أَهْلِ الدِّيَارِ مِنَ الْمُؤْمِنِينَ وَالْمُسْلِمِينَ وَيَرْحَمُ اللَّهُ الْمُسْتَقْدِمِينَ مِنَّا وَالْمُسْتَأْخِرِينَ وَإِنَّا إِنْ شَاءَ اللَّهُ بِكُمْ لَلاَحِقُونَ",
    "tags": ["Masnoon", "Supplication"],
    "referenceLink": "https://sunnah.com/muslim:974b",
    "translation": "Narrated by Ayesha A.S: I said: Messenger of Allah, how should I pray for them (How should I beg forgiveness for them)? He said: Say, Peace be upon the inhabitants of this city (graveyard) from among the Believers and the Muslims, and may Allah have mercy on those who have gone ahead of us, and those who come later on, and we shall, God willing, join you."
  }
]
